---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditRangesOfApplicability
source: html/f6144e3c-7bdd-6386-d5c0-a2a7e3cf96dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditRangesOfApplicability Property

"Modify Ranges of applicability"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionEditRangesOfApplicability { get; }
```